"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.
"""

n = int(input("Введите число: "))

lp = 0.0
num_set = ""
for i in range(1, n + 1):
    lp += float(i)
    num_set += f"{i} "

rp = n * (n + 1) / 2

if rp == lp:
    print("Равенство выполняется")
else:
    print("Равенство не выполняется")

print(f"{num_set} = {n}*({n}+1)/2")
print(f"{lp} = {rp}")